In [80]:
import pandas as pd

In [81]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame

In [5]:
city = ['Dhaka', 'Rajshahi', 'Chittagong']

In [6]:
city

['Dhaka', 'Rajshahi', 'Chittagong']

In [7]:
df = pd.DataFrame(city)

In [8]:
df

            0
0       Dhaka
1    Rajshahi
2  Chittagong

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(city)

list

In [12]:
row, column = df.shape

In [13]:
row

3

In [14]:
column

1

In [15]:
df = pd.DataFrame(city, columns=['City_in_BD'])
df

   City_in_BD
0       Dhaka
1    Rajshahi
2  Chittagong

In [16]:
df = pd.DataFrame(city, columns=['City_in_BD'], index=['c1','c2','c3'])
df

    City_in_BD
c1       Dhaka
c2    Rajshahi
c3  Chittagong

In [17]:
city2 = ['Dortmund', 'Paris', 'Postdam']

In [18]:
df2 = pd.DataFrame(zip(city, city2), columns=['City1', 'City2'])

In [19]:
df2

        City1     City2
0       Dhaka  Dortmund
1    Rajshahi     Paris
2  Chittagong   Postdam

In [21]:
df2.shape

(3, 2)

In [23]:
city3 = [['Bavaria', 'Erlangen'], ['NRW', 'Dortmund']]

In [24]:
city3

[['Bavaria', 'Erlangen'], ['NRW', 'Dortmund']]

In [27]:
df4 = pd.DataFrame(city3, columns=['State', 'City'])

In [28]:
df4

     State      City
0  Bavaria  Erlangen
1      NRW  Dortmund

In [29]:
city

['Dhaka', 'Rajshahi', 'Chittagong']

In [30]:
city2

['Dortmund', 'Paris', 'Postdam']

In [31]:
dict1 = {
    'city1': city,
    'city2': city2,
}

In [32]:
dict1

{'city1': ['Dhaka', 'Rajshahi', 'Chittagong'],
 'city2': ['Dortmund', 'Paris', 'Postdam']}

In [33]:
df5 = pd.DataFrame(dict1)

In [34]:
df5

        city1     city2
0       Dhaka  Dortmund
1    Rajshahi     Paris
2  Chittagong   Postdam

In [35]:
type(dict1)

dict

In [49]:
df = pd.read_excel('Data.xlsx')

In [50]:
df

  Members  Deposit
0   Hablu     2000
1   Kablu     3000
2   Dablu     1500
3    Iblu      200

In [51]:
df.head()

  Members  Deposit
0   Hablu     2000
1   Kablu     3000
2   Dablu     1500
3    Iblu      200

In [52]:
df.tail()

  Members  Deposit
0   Hablu     2000
1   Kablu     3000
2   Dablu     1500
3    Iblu      200

In [54]:
print(df.values)

[['Hablu' 2000]
 ['Kablu' 3000]
 ['Dablu' 1500]
 ['Iblu' 200]]

In [55]:
df.values

array([['Hablu', 2000],
       ['Kablu', 3000],
       ['Dablu', 1500],
       ['Iblu', 200]], dtype=object)

In [56]:
df.columns

Index(['Members', 'Deposit'], dtype='object')

In [57]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [58]:
df.Deposit

0    2000
1    3000
2    1500
3     200
Name: Deposit, dtype: int64

In [59]:
df['Members']

0    Hablu
1    Kablu
2    Dablu
3     Iblu
Name: Members, dtype: object

In [60]:
df['Members'].head(2)

0    Hablu
1    Kablu
Name: Members, dtype: object

In [62]:
df[['Members','Deposit']].head()

  Members  Deposit
0   Hablu     2000
1   Kablu     3000
2   Dablu     1500
3    Iblu      200

In [63]:
df['Deposit'].sort_values()

3     200
2    1500
0    2000
1    3000
Name: Deposit, dtype: int64

In [64]:
df['Deposit'].sort_values(ascending=False)

1    3000
0    2000
2    1500
3     200
Name: Deposit, dtype: int64

In [65]:
df.sort_values('Deposit', ascending=False)

  Members  Deposit
1   Kablu     3000
0   Hablu     2000
2   Dablu     1500
3    Iblu      200

In [66]:
df.sort_values('Deposit', ascending=True)

  Members  Deposit
3    Iblu      200
2   Dablu     1500
0   Hablu     2000
1   Kablu     3000

In [67]:
df.describe()

           Deposit
count     4.000000
mean   1675.000000
std    1164.402565
min     200.000000
25%    1175.000000
50%    1750.000000
75%    2250.000000
max    3000.000000

In [71]:
df['Deposit'] > 1000

0     True
1     True
2     True
3    False
Name: Deposit, dtype: bool

In [72]:
df[df['Deposit'] > 1000]

  Members  Deposit
0   Hablu     2000
1   Kablu     3000
2   Dablu     1500

In [73]:
df[df['Members'] == 'Hablu']

  Members  Deposit
0   Hablu     2000

In [76]:
df[(df['Members'] == 'Hablu') | (df['Members'] == 'Dablu')]

  Members  Deposit
0   Hablu     2000
2   Dablu     1500

In [77]:
df['Members'].isin(['Hablu', 'Dablu'])

0     True
1    False
2     True
3    False
Name: Members, dtype: bool

In [78]:
df[df['Members'].isin(['Hablu', 'Dablu'])]

  Members  Deposit
0   Hablu     2000
2   Dablu     1500